Switch#SHOW VLAN BRIEF

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/2, Fa0/3, Fa0/4, Fa0/5
                                                Fa0/6, Fa0/7, Fa0/8, Fa0/9
                                                Fa0/10, Fa0/11, Fa0/12, Fa0/13
                                                Fa0/14, Fa0/15, Fa0/16, Fa0/17
                                                Fa0/18, Fa0/19, Fa0/20, Fa0/21
                                                Fa0/22, Fa0/23, Fa0/24
2    Professores                      active    Fa0/1
3    Alunos                           active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
Switch#Configure Terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#INT F0/3
Switch(config-if)#Switchport Access VLAN 3
Switch(config-if)#END
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#
Switch#Configure Terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#INT F0/4
Switch(config-if)#Switchport Access VLAN 4
% Access VLAN does not exist. Creating vlan 4
Switch(config-if)#Switchport Access VLAN 3
Switch(config-if)#END
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#
Switch#SHOW VLAN BRIEF 

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/2, Fa0/5, Fa0/6, Fa0/7
                                                Fa0/8, Fa0/9, Fa0/10, Fa0/11
                                                Fa0/12, Fa0/13, Fa0/14, Fa0/15
                                                Fa0/16, Fa0/17, Fa0/18, Fa0/19
                                                Fa0/20, Fa0/21, Fa0/22, Fa0/23
                                                Fa0/24
2    Professores                      active    Fa0/1
3    Alunos                           active    Fa0/3, Fa0/4
4    VLAN0004                         active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
Switch#INT F0/2
           ^
% Invalid input detected at '^' marker.
	
Switch#Configure Terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#INT F0/2
Switch(config-if)#Switchport Access VLAN 2
Switch(config-if)#END
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#SHOW VLAN BRIEF

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
2    Professores                      active    Fa0/1, Fa0/2
3    Alunos                           active    Fa0/3, Fa0/4
4    VLAN0004                         active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
Switch#SHOW RUN
Building configuration...

Current configuration : 1842 bytes
!
version 12.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Switch
!
!
!
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
 switchport access vlan 2
 switchport mode dynamic auto
!
interface FastEthernet0/2
 switchport access vlan 2
 switchport mode dynamic auto
!
interface FastEthernet0/3
 switchport access vlan 3
 switchport mode dynamic auto
!
interface FastEthernet0/4
 switchport access vlan 3
 switchport mode dynamic auto
!
interface FastEthernet0/5
 switchport mode dynamic auto
!
interface FastEthernet0/6
 switchport mode dynamic auto
!
interface FastEthernet0/7
 switchport mode dynamic auto
!
interface FastEthernet0/8
 switchport mode dynamic auto
!
interface FastEthernet0/9
 switchport mode dynamic auto
!
interface FastEthernet0/10
 switchport mode dynamic auto
!
interface FastEthernet0/11
 switchport mode dynamic auto
!
interface FastEthernet0/12
 switchport mode dynamic auto
!
interface FastEthernet0/13
 switchport mode dynamic auto
!
interface FastEthernet0/14
 switchport mode dynamic auto
!
interface FastEthernet0/15
 switchport mode dynamic auto
!
interface FastEthernet0/16
 switchport mode dynamic auto
!
interface FastEthernet0/17
 switchport mode dynamic auto
!
interface FastEthernet0/18
 switchport mode dynamic auto
!
interface FastEthernet0/19
 switchport mode dynamic auto
!
interface FastEthernet0/20
 switchport mode dynamic auto
!
interface FastEthernet0/21
 switchport mode dynamic auto
!
interface FastEthernet0/22
 switchport mode dynamic auto
!
interface FastEthernet0/23
 switchport mode dynamic auto
!
interface FastEthernet0/24
 switchport mode dynamic auto
!
interface Vlan1
 no ip address
 shutdown
!
!
!
!
line con 0
!
line vty 0 4
 login
line vty 5 15
 login
!
!
!
!
end


Switch#
Switch#
Switch#WR
Building configuration...
[OK]
Switch#	
